In [207]:
import pandas as pd

Read files

In [208]:
%ls

Data analytics notebook.ipynb

In [209]:
wifi_log_data = pd.read_csv("../cleaned_data/full.csv", names=["room", "event_time", "detec1", "detec2"])
wifi_log_data.head()

,room,event_time,detec1,detec2
0,Belfield > Computer Science > B-002,Mon Nov 02 20:32:06 GMT+00:00 2015,0,0
1,Belfield > Computer Science > B-002,Mon Nov 02 20:37:10 GMT+00:00 2015,0,0
2,Belfield > Computer Science > B-002,Mon Nov 02 20:42:12 GMT+00:00 2015,0,0
3,Belfield > Computer Science > B-002,Mon Nov 02 20:47:14 GMT+00:00 2015,0,0
4,Belfield > Computer Science > B-002,Mon Nov 02 20:52:11 GMT+00:00 2015,0,0

In [210]:
wifi_log_data.tail()

,room,event_time,detec1,detec2
12412,Belfield > Computer Science > B-004,Tue Nov 17 11:01:59 GMT+00:00 2015,18,18
12413,Belfield > Computer Science > B-004,Tue Nov 17 11:06:37 GMT+00:00 2015,32,32
12414,Belfield > Computer Science > B-004,Tue Nov 17 11:13:19 GMT+00:00 2015,39,39
12415,Belfield > Computer Science > B-004,Tue Nov 17 11:21:11 GMT+00:00 2015,42,42
12416,Belfield > Computer Science > B-004,Tue Nov 17 11:26:07 GMT+00:00 2015,46,46

In [211]:
import time
from dateutil.parser import parse

for i in range(wifi_log_data.shape[0]):
    x = wifi_log_data["event_time"][i]
    y = parse(x)
    epoch = int(time.mktime(y.timetuple()))
    wifi_log_data.set_value(i,"event_time",epoch)

In [212]:
wifi_log_data.head()

                                  room  event_time  detec1  detec2
0  Belfield > Computer Science > B-002  1446496326       0       0
1  Belfield > Computer Science > B-002  1446496630       0       0
2  Belfield > Computer Science > B-002  1446496932       0       0
3  Belfield > Computer Science > B-002  1446497234       0       0
4  Belfield > Computer Science > B-002  1446497531       0       0

In [213]:
for i in range(wifi_log_data.shape[0]):
    wifi_log_data.set_value(i, "room", wifi_log_data["room"][i][-1:])

In [214]:
wifi_log_data.head()

  room  event_time  detec1  detec2
0    2  1446496326       0       0
1    2  1446496630       0       0
2    2  1446496932       0       0
3    2  1446497234       0       0
4    2  1446497531       0       0

In [215]:
wifi_log_data.tail()

      room  event_time  detec1  detec2
12412    4  1447758119      18      18
12413    4  1447758397      32      32
12414    4  1447758799      39      39
12415    4  1447759271      42      42
12416    4  1447759567      46      46

In [216]:
wifi_log_data["building"] = "school of computer science"

In [217]:
wifi_log_data.head()

  room  event_time  detec1  detec2                    building
0    2  1446496326       0       0  school of computer science
1    2  1446496630       0       0  school of computer science
2    2  1446496932       0       0  school of computer science
3    2  1446497234       0       0  school of computer science
4    2  1446497531       0       0  school of computer science

In [218]:
occupancy_data = pd.read_csv("../cleaned_data/survey_data.csv")

In [219]:
occupancy_data.head()

   Unnamed: 0  room  event_time  occupancy                    building
0           0     4  1446454800       0.25  school of computer science
1           1     2  1446454800       0.25  school of computer science
2           2     3  1446454800       0.25  school of computer science
3           3     4  1446458400       0.50  school of computer science
4           4     2  1446458400       0.50  school of computer science

In [220]:
occupancy_data.tail()

     Unnamed: 0  room  event_time  occupancy                    building
235         235     2  1447426800       0.25  school of computer science
236         236     3  1447426800       0.25  school of computer science
237         237     4  1447430400       0.00  school of computer science
238         238     2  1447430400       0.25  school of computer science
239         239     3  1447430400       0.25  school of computer science

In [221]:
del occupancy_data["Unnamed: 0"]

In [222]:
occupancy_data.head()

   room  event_time  occupancy                    building
0     4  1446454800       0.25  school of computer science
1     2  1446454800       0.25  school of computer science
2     3  1446454800       0.25  school of computer science
3     4  1446458400       0.50  school of computer science
4     2  1446458400       0.50  school of computer science

In [223]:
occupancy_data['event_time'] = pd.to_datetime(occupancy_data.event_time, unit='s')
occupancy_data.head()

   room          event_time  occupancy                    building
0     4 2015-11-02 09:00:00       0.25  school of computer science
1     2 2015-11-02 09:00:00       0.25  school of computer science
2     3 2015-11-02 09:00:00       0.25  school of computer science
3     4 2015-11-02 10:00:00       0.50  school of computer science
4     2 2015-11-02 10:00:00       0.50  school of computer science

In [224]:
wifi_log_data['event_time'] = pd.to_datetime(wifi_log_data.event_time, unit='s')
wifi_log_data.set_index('event_time', inplace=True)
wifi_log_data.head()

                    room  detec1  detec2                    building
event_time
2015-11-02 20:32:06    2       0       0  school of computer science
2015-11-02 20:37:10    2       0       0  school of computer science
2015-11-02 20:42:12    2       0       0  school of computer science
2015-11-02 20:47:14    2       0       0  school of computer science
2015-11-02 20:52:11    2       0       0  school of computer science

In [225]:
wifi_log_data['event_hour'] = wifi_log_data.index.hour
wifi_log_data['event_day'] = wifi_log_data.index.day

wifi_log_data.index.name = None

wifi_log_data.head()

,room,detec1,detec2,building,event_hour,event_day
2015-11-02 20:32:06,2,0,0,school of computer science,20,2
2015-11-02 20:37:10,2,0,0,school of computer science,20,2
2015-11-02 20:42:12,2,0,0,school of computer science,20,2
2015-11-02 20:47:14,2,0,0,school of computer science,20,2
2015-11-02 20:52:11,2,0,0,school of computer science,20,2

In [226]:
occupancy_data['event_time'] = pd.to_datetime(occupancy_data.event_time, unit='s')
occupancy_data.set_index('event_time', inplace=True)
occupancy_data.head()

                     room  occupancy                    building
event_time
2015-11-02 09:00:00     4       0.25  school of computer science
2015-11-02 09:00:00     2       0.25  school of computer science
2015-11-02 09:00:00     3       0.25  school of computer science
2015-11-02 10:00:00     4       0.50  school of computer science
2015-11-02 10:00:00     2       0.50  school of computer science

In [227]:
occupancy_data['event_hour'] = occupancy_data.index.hour
occupancy_data['event_day'] = occupancy_data.index.day

occupancy_data.index.name = None

occupancy_data.head()

,room,occupancy,building,event_hour,event_day
2015-11-02 09:00:00,4,0.25,school of computer science,9,2
2015-11-02 09:00:00,2,0.25,school of computer science,9,2
2015-11-02 09:00:00,3,0.25,school of computer science,9,2
2015-11-02 10:00:00,4,0.50,school of computer science,10,2
2015-11-02 10:00:00,2,0.50,school of computer science,10,2

In [228]:
df_mean_conn = wifi_log_data.groupby(['room', 'event_day', 'event_hour'], as_index=False).mean()

In [229]:
df_mean_conn.head()

  room  event_day  event_hour  detec1  detec2
0    2          2          20     0.0     0.0
1    2          2          21     0.0     0.0
2    2          2          22     0.0     0.0
3    2          2          23     0.0     0.0
4    2          3           0     0.0     0.0

In [233]:
df_mean_conn['room'] = df_mean_conn['room'].astype(int)

print(df_mean_conn.dtypes)

room            int64
event_day       int64
event_hour      int64
detec1        float64
detec2        float64
dtype: object

In [234]:
occupancy_data.dtypes

room            int64
occupancy     float64
building       object
event_hour      int32
event_day       int32
dtype: object

In [236]:
df = pd.merge(df_mean_conn, occupancy_data, on=['room', 'event_day', 'event_hour'], how='inner')

df.head(15)

,room,event_day,event_hour,detec1,detec2,occupancy,building
0,2,3,9,4.750000,4.666667,0.00,school of computer science
1,2,3,10,29.272727,29.181818,0.50,school of computer science
2,2,3,11,28.727273,28.636364,0.50,school of computer science
3,2,3,12,14.166667,14.166667,0.50,school of computer science
4,2,3,13,14.250000,14.166667,0.00,school of computer science
5,2,3,14,46.363636,46.181818,0.75,school of computer science
6,2,3,15,40.272727,39.727273,0.25,school of computer science
7,2,3,16,36.416667,35.916667,0.25,school of computer science
8,2,4,9,13.454545,13.363636,0.25,school of computer science
9,2,4,10,14.416667,14.333333,0.25,school of computer science
10,2,4,11,8.363636,8.272727,0.25,school of computer science
11,2,4,12,33.181818,33.000000,0.50,school of computer science
12,2,4,13,25.083333,25.083333,0.00,school of computer science
13,2,4,14,23.000000,23.000000,0.25,school of computer science
14,2,4,15,5.545455,5.545455,0.00,school of computer science